In [2]:
import pandas as pd

In [5]:
li=[3,4,5,6]
s=pd.Series(li,index=['a','b','c','d'])

In [6]:
s[2]

5

In [8]:
s['b']

4

In [34]:
d={
    "id":[1],
    "Name":["jyothi"],
    "Role":["Software engineer"],
    "Location":["Vizag"]
}

In [35]:
df=pd.DataFrame(d)
df

   id    Name               Role Location
0   1  jyothi  Software engineer    Vizag

In [36]:
ds=pd.Series(d)

In [37]:
ds

id                          [1]
Name                   [jyothi]
Role        [Software engineer]
Location                [Vizag]
dtype: object

In [38]:
ds[2]

['Software engineer']

In [39]:
ds,df

(id                          [1]
 Name                   [jyothi]
 Role        [Software engineer]
 Location                [Vizag]
 dtype: object,    id    Name               Role Location
 0   1  jyothi  Software engineer    Vizag)

In [40]:
import pandas as pd

In [41]:
d2={"id":[1,2,3,4],
     "Name":["Priya","Jyothi","Siri","Laxmi"],
     "Location":["Chinnamuliwada","Anakapelli","Kurmanpallam","Bangalure"],
     "Education":["CSE","CSE","EEE","EEE"]
    }

In [42]:
df2=pd.DataFrame(d2)
df2

   id    Name        Location Education
0   1   Priya  Chinnamuliwada       CSE
1   2  Jyothi      Anakapelli       CSE
2   3    Siri    Kurmanpallam       EEE
3   4   Laxmi       Bangalure       EEE

In [43]:
pd.merge(df,df2,how="outer")

   id    Name               Role        Location Education
0   1  jyothi  Software engineer           Vizag       NaN
1   1   Priya                NaN  Chinnamuliwada       CSE
2   2  Jyothi                NaN      Anakapelli       CSE
3   3    Siri                NaN    Kurmanpallam       EEE
4   4   Laxmi                NaN       Bangalure       EEE

In [44]:
pd.merge(df,df2,how="inner",on="id")

   id  Name_x               Role Location_x Name_y      Location_y Education
0   1  jyothi  Software engineer      Vizag  Priya  Chinnamuliwada       CSE

In [45]:
pd.merge(df,df2,how="inner")

Empty DataFrame
Columns: [id, Name, Role, Location, Education]
Index: []

In [46]:
pd.merge(df,df2,how="right")

   id    Name Role        Location Education
0   1   Priya  NaN  Chinnamuliwada       CSE
1   2  Jyothi  NaN      Anakapelli       CSE
2   3    Siri  NaN    Kurmanpallam       EEE
3   4   Laxmi  NaN       Bangalure       EEE

In [47]:
pd.merge(df,df2,how="left")

   id    Name               Role Location Education
0   1  jyothi  Software engineer    Vizag       NaN

In [17]:
import pandas as pd

In [18]:
dict1={
    "company":["google","apple","microsoft","amazon"],
    "application":["google asistent","siri","cortana","alexa"]
    
    
}

In [20]:
dict1["location"]=["hyd","banglore","chennai","vizag"]

In [21]:
df=pd.DataFrame(dict1)

In [22]:
df

     company      application  location
0     google  google asistent       hyd
1      apple             siri  banglore
2  microsoft          cortana   chennai
3     amazon            alexa     vizag

In [23]:
df.pivot(index="company", columns="application")

            location
application    alexa  cortana google asistent      siri
company
amazon         vizag      NaN             NaN       NaN
apple            NaN      NaN             NaN  banglore
google           NaN      NaN             hyd       NaN
microsoft        NaN  chennai             NaN       NaN

In [24]:
df.pivot(index="company", columns="application",values="location")

application  alexa  cortana google asistent      siri
company
amazon       vizag      NaN             NaN       NaN
apple          NaN      NaN             NaN  banglore
google         NaN      NaN             hyd       NaN
microsoft      NaN  chennai             NaN       NaN